test/k6/output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/k6/basic-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 40s max duration (incl. graceful stop):
              * default: 5 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  01.0s/10s

running (02.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  02.0s/10s

running (02.3s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  02.3s/10s

running (02.5s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  02.5s/10s

running (02.5s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  02.5s/10s

running (02.5s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  02.5s/10s

running (02.5s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  02.5s/10s

running (02.5s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  02.5s/10s

running (02.5s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  02.5s/10s

running (02.6s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  02.6s/10s

running (03.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  03.0s/10s

running (04.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  04.0s/10s

running (05.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  05.0s/10s

running (06.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  06.0s/10s

running (07.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  07.0s/10s

running (08.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  08.0s/10s

running (09.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  09.0s/10s

running (11.1s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......: 100    8.642676/s
    checks_succeeded...: 97.00% 97 out of 100
    checks_failed......: 3.00%  3 out of 100

    ✗ status is 200
      ↳  94% — ✓ 47 / ✗ 3
    ✓ response time < 500ms

    HTTP
    http_req_duration..............: avg=37.08ms min=5.26ms  med=31.55ms max=103.07ms p(90)=71.3ms  p(95)=91.38ms
      { expected_response:true }...: avg=39.09ms min=10.59ms med=32.26ms max=103.07ms p(90)=72.02ms p(95)=95.24ms
    http_req_failed................: 6.00%  3 out of 50
    http_reqs......................: 50     4.321338/s

    EXECUTION
    iteration_duration.............: avg=1.03s   min=1s      med=1.03s   max=1.1s     p(90)=1.07s   p(95)=1.09s  
    iterations.....................: 50     4.321338/s
    vus............................: 5      min=5       max=5
    vus_max........................: 5      min=5       max=5

    NETWORK
    data_received..................: 2.3 MB 201 kB/s
    data_sent......................: 3.5 kB 303 B/s



running (11.6s), 0/5 VUs, 50 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  10s