test/k6/output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/k6/basic-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 1m20s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m01.0s/1m20.0s

running (0m02.0s), 01/50 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 01/50 VUs  0m02.0s/1m20.0s

running (0m03.0s), 02/50 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 02/50 VUs  0m03.0s/1m20.0s

running (0m04.0s), 02/50 VUs, 4 complete and 0 interrupted iterations
default   [   5% ] 02/50 VUs  0m04.0s/1m20.0s

running (0m05.0s), 03/50 VUs, 6 complete and 0 interrupted iterations
default   [   6% ] 03/50 VUs  0m05.0s/1m20.0s

running (0m06.0s), 03/50 VUs, 9 complete and 0 interrupted iterations
default   [   7% ] 03/50 VUs  0m06.0s/1m20.0s

running (0m07.0s), 04/50 VUs, 12 complete and 0 interrupted iterations
default   [   9% ] 04/50 VUs  0m07.0s/1m20.0s

running (0m08.0s), 04/50 VUs, 16 complete and 0 interrupted iterations
default   [  10% ] 04/50 VUs  0m08.0s/1m20.0s

running (0m09.0s), 05/50 VUs, 20 complete and 0 interrupted iterations
default   [  11% ] 05/50 VUs  0m09.0s/1m20.0s

running (0m10.0s), 05/50 VUs, 25 complete and 0 interrupted iterations
default   [  12% ] 05/50 VUs  0m10.0s/1m20.0s

running (0m11.0s), 05/50 VUs, 30 complete and 0 interrupted iterations
default   [  14% ] 05/50 VUs  0m11.0s/1m20.0s

running (0m12.0s), 06/50 VUs, 35 complete and 0 interrupted iterations
default   [  15% ] 06/50 VUs  0m12.0s/1m20.0s

running (0m13.0s), 06/50 VUs, 41 complete and 0 interrupted iterations
default   [  16% ] 06/50 VUs  0m13.0s/1m20.0s

running (0m14.0s), 07/50 VUs, 47 complete and 0 interrupted iterations
default   [  17% ] 07/50 VUs  0m14.0s/1m20.0s

running (0m15.0s), 07/50 VUs, 53 complete and 0 interrupted iterations
default   [  19% ] 07/50 VUs  0m15.0s/1m20.0s

running (0m17.0s), 08/50 VUs, 60 complete and 0 interrupted iterations
default   [  20% ] 08/50 VUs  0m16.0s/1m20.0s

running (0m18.0s), 08/50 VUs, 68 complete and 0 interrupted iterations
default   [  21% ] 08/50 VUs  0m17.0s/1m20.0s

running (0m18.1s), 08/50 VUs, 68 complete and 0 interrupted iterations
default   [  21% ] 08/50 VUs  0m17.1s/1m20.0s

running (0m18.1s), 08/50 VUs, 68 complete and 0 interrupted iterations
default   [  21% ] 08/50 VUs  0m17.1s/1m20.0s

running (0m18.1s), 08/50 VUs, 68 complete and 0 interrupted iterations
default   [  21% ] 08/50 VUs  0m17.1s/1m20.0s

running (0m18.1s), 08/50 VUs, 68 complete and 0 interrupted iterations
default   [  21% ] 08/50 VUs  0m17.1s/1m20.0s

running (0m18.1s), 08/50 VUs, 68 complete and 0 interrupted iterations
default   [  21% ] 08/50 VUs  0m17.1s/1m20.0s

running (0m19.0s), 09/50 VUs, 76 complete and 0 interrupted iterations
default   [  22% ] 09/50 VUs  0m18.0s/1m20.0s

running (0m20.0s), 09/50 VUs, 85 complete and 0 interrupted iterations
default   [  24% ] 09/50 VUs  0m19.0s/1m20.0s

running (0m21.0s), 09/50 VUs, 94 complete and 0 interrupted iterations
default   [  25% ] 09/50 VUs  0m20.0s/1m20.0s

running (0m22.0s), 10/50 VUs, 103 complete and 0 interrupted iterations
default   [  26% ] 10/50 VUs  0m21.0s/1m20.0s

running (0m23.0s), 11/50 VUs, 113 complete and 0 interrupted iterations
default   [  27% ] 11/50 VUs  0m22.0s/1m20.0s

running (0m24.1s), 12/50 VUs, 124 complete and 0 interrupted iterations
default   [  29% ] 12/50 VUs  0m23.0s/1m20.0s

running (0m25.0s), 13/50 VUs, 136 complete and 0 interrupted iterations
default   [  30% ] 13/50 VUs  0m24.0s/1m20.0s

running (0m26.0s), 14/50 VUs, 149 complete and 0 interrupted iterations
default   [  31% ] 14/50 VUs  0m25.0s/1m20.0s

running (0m27.0s), 15/50 VUs, 163 complete and 0 interrupted iterations
default   [  32% ] 15/50 VUs  0m26.0s/1m20.0s

running (0m28.0s), 16/50 VUs, 178 complete and 0 interrupted iterations
default   [  34% ] 16/50 VUs  0m27.0s/1m20.0s

running (0m29.0s), 17/50 VUs, 194 complete and 0 interrupted iterations
default   [  35% ] 17/50 VUs  0m28.0s/1m20.0s

running (0m30.0s), 18/50 VUs, 210 complete and 0 interrupted iterations
default   [  36% ] 18/50 VUs  0m29.0s/1m20.0s

running (0m31.0s), 19/50 VUs, 228 complete and 0 interrupted iterations
default   [  37% ] 19/50 VUs  0m30.0s/1m20.0s

running (0m32.0s), 20/50 VUs, 246 complete and 0 interrupted iterations
default   [  39% ] 20/50 VUs  0m31.0s/1m20.0s

running (0m33.0s), 21/50 VUs, 266 complete and 0 interrupted iterations
default   [  40% ] 21/50 VUs  0m32.0s/1m20.0s

running (0m34.0s), 22/50 VUs, 287 complete and 0 interrupted iterations
default   [  41% ] 22/50 VUs  0m33.0s/1m20.0s

running (0m35.0s), 23/50 VUs, 309 complete and 0 interrupted iterations
default   [  42% ] 23/50 VUs  0m34.0s/1m20.0s

running (0m36.0s), 24/50 VUs, 332 complete and 0 interrupted iterations
default   [  44% ] 24/50 VUs  0m35.0s/1m20.0s

running (0m37.0s), 25/50 VUs, 355 complete and 0 interrupted iterations
default   [  45% ] 25/50 VUs  0m36.0s/1m20.0s

running (0m38.0s), 26/50 VUs, 380 complete and 0 interrupted iterations
default   [  46% ] 26/50 VUs  0m37.0s/1m20.0s

running (0m38.8s), 27/50 VUs, 403 complete and 0 interrupted iterations
default   [  47% ] 27/50 VUs  0m37.7s/1m20.0s

running (0m38.8s), 27/50 VUs, 403 complete and 0 interrupted iterations
default   [  47% ] 27/50 VUs  0m37.7s/1m20.0s

running (0m39.0s), 27/50 VUs, 406 complete and 0 interrupted iterations
default   [  47% ] 27/50 VUs  0m38.0s/1m20.0s

running (0m40.0s), 28/50 VUs, 433 complete and 0 interrupted iterations
default   [  49% ] 28/50 VUs  0m39.0s/1m20.0s

running (0m41.0s), 29/50 VUs, 461 complete and 0 interrupted iterations
default   [  50% ] 29/50 VUs  0m40.0s/1m20.0s

running (0m42.0s), 30/50 VUs, 490 complete and 0 interrupted iterations
default   [  51% ] 30/50 VUs  0m41.0s/1m20.0s

running (0m43.1s), 31/50 VUs, 520 complete and 0 interrupted iterations
default   [  52% ] 31/50 VUs  0m42.0s/1m20.0s

running (0m44.0s), 32/50 VUs, 551 complete and 0 interrupted iterations
default   [  54% ] 32/50 VUs  0m43.0s/1m20.0s

running (0m45.0s), 33/50 VUs, 583 complete and 0 interrupted iterations
default   [  55% ] 33/50 VUs  0m44.0s/1m20.0s

running (0m46.0s), 34/50 VUs, 616 complete and 0 interrupted iterations
default   [  56% ] 34/50 VUs  0m45.0s/1m20.0s

running (0m47.0s), 35/50 VUs, 650 complete and 0 interrupted iterations
default   [  57% ] 35/50 VUs  0m46.0s/1m20.0s

running (0m48.0s), 36/50 VUs, 684 complete and 0 interrupted iterations
default   [  59% ] 36/50 VUs  0m47.0s/1m20.0s

running (0m50.2s), 37/50 VUs, 720 complete and 0 interrupted iterations
default   [  60% ] 37/50 VUs  0m48.0s/1m20.0s

running (0m51.2s), 38/50 VUs, 757 complete and 0 interrupted iterations
default   [  61% ] 38/50 VUs  0m49.0s/1m20.0s

running (0m52.2s), 39/50 VUs, 795 complete and 0 interrupted iterations
default   [  62% ] 39/50 VUs  0m50.0s/1m20.0s

running (0m53.2s), 40/50 VUs, 834 complete and 0 interrupted iterations
default   [  64% ] 40/50 VUs  0m51.0s/1m20.0s

running (0m54.2s), 41/50 VUs, 874 complete and 0 interrupted iterations
default   [  65% ] 41/50 VUs  0m52.0s/1m20.0s

running (0m55.2s), 42/50 VUs, 915 complete and 0 interrupted iterations
default   [  66% ] 42/50 VUs  0m53.0s/1m20.0s

running (0m56.2s), 43/50 VUs, 953 complete and 0 interrupted iterations
default   [  67% ] 43/50 VUs  0m54.0s/1m20.0s

running (0m57.2s), 44/50 VUs, 993 complete and 0 interrupted iterations
default   [  69% ] 44/50 VUs  0m55.0s/1m20.0s

running (0m58.2s), 45/50 VUs, 1037 complete and 0 interrupted iterations
default   [  70% ] 45/50 VUs  0m56.0s/1m20.0s

running (0m59.2s), 46/50 VUs, 1082 complete and 0 interrupted iterations
default   [  71% ] 46/50 VUs  0m57.0s/1m20.0s

running (1m00.2s), 47/50 VUs, 1124 complete and 0 interrupted iterations
default   [  72% ] 47/50 VUs  0m58.0s/1m20.0s

running (1m01.2s), 48/50 VUs, 1171 complete and 0 interrupted iterations
default   [  74% ] 48/50 VUs  0m59.0s/1m20.0s

running (1m02.2s), 49/50 VUs, 1217 complete and 0 interrupted iterations
default   [  75% ] 49/50 VUs  1m00.0s/1m20.0s

running (1m03.2s), 50/50 VUs, 1266 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  1m01.0s/1m20.0s

running (1m04.2s), 48/50 VUs, 1313 complete and 0 interrupted iterations
default   [  77% ] 48/50 VUs  1m02.0s/1m20.0s

running (1m05.2s), 45/50 VUs, 1361 complete and 0 interrupted iterations
default   [  79% ] 45/50 VUs  1m03.0s/1m20.0s

running (1m06.2s), 42/50 VUs, 1406 complete and 0 interrupted iterations
default   [  80% ] 42/50 VUs  1m04.0s/1m20.0s

running (1m07.2s), 39/50 VUs, 1448 complete and 0 interrupted iterations
default   [  81% ] 39/50 VUs  1m05.0s/1m20.0s

running (1m08.2s), 36/50 VUs, 1487 complete and 0 interrupted iterations
default   [  82% ] 36/50 VUs  1m06.0s/1m20.0s

running (1m09.2s), 34/50 VUs, 1523 complete and 0 interrupted iterations
default   [  84% ] 34/50 VUs  1m07.0s/1m20.0s

running (1m10.2s), 31/50 VUs, 1557 complete and 0 interrupted iterations
default   [  85% ] 31/50 VUs  1m08.0s/1m20.0s

running (1m11.2s), 28/50 VUs, 1588 complete and 0 interrupted iterations
default   [  86% ] 28/50 VUs  1m09.0s/1m20.0s

running (1m12.2s), 26/50 VUs, 1615 complete and 0 interrupted iterations
default   [  87% ] 26/50 VUs  1m10.0s/1m20.0s

running (1m13.2s), 23/50 VUs, 1636 complete and 0 interrupted iterations
default   [  89% ] 23/50 VUs  1m11.0s/1m20.0s

running (1m14.2s), 23/50 VUs, 1659 complete and 0 interrupted iterations
default   [  90% ] 23/50 VUs  1m12.0s/1m20.0s

running (1m15.2s), 20/50 VUs, 1672 complete and 0 interrupted iterations
default   [  91% ] 20/50 VUs  1m13.0s/1m20.0s

running (1m16.2s), 18/50 VUs, 1692 complete and 0 interrupted iterations
default   [  92% ] 18/50 VUs  1m14.0s/1m20.0s

running (1m17.2s), 15/50 VUs, 1710 complete and 0 interrupted iterations
default   [  94% ] 15/50 VUs  1m15.0s/1m20.0s

running (1m18.2s), 12/50 VUs, 1725 complete and 0 interrupted iterations
default   [  95% ] 12/50 VUs  1m16.0s/1m20.0s

running (1m19.2s), 10/50 VUs, 1737 complete and 0 interrupted iterations
default   [  96% ] 10/50 VUs  1m17.0s/1m20.0s

running (1m20.2s), 07/50 VUs, 1747 complete and 0 interrupted iterations
default   [  97% ] 07/50 VUs  1m18.0s/1m20.0s

running (1m21.2s), 05/50 VUs, 1754 complete and 0 interrupted iterations
default   [  99% ] 05/50 VUs  1m19.0s/1m20.0s

running (1m22.2s), 02/50 VUs, 1759 complete and 0 interrupted iterations
default   [ 100% ] 02/50 VUs  1m20.0s/1m20.0s


  █ TOTAL RESULTS 

    checks_total.......: 3522   42.147718/s
    checks_succeeded...: 98.23% 3460 out of 3522
    checks_failed......: 1.76%  62 out of 3522

    ✗ status is 200
      ↳  96% — ✓ 1699 / ✗ 62
    ✓ response time < 500ms

    HTTP
    http_req_duration..............: avg=29.82ms min=1.91ms med=21.79ms max=156.99ms p(90)=58.67ms p(95)=74.75ms
      { expected_response:true }...: avg=30.64ms min=5.04ms med=22.74ms max=156.99ms p(90)=60.01ms p(95)=76.06ms
    http_req_failed................: 3.52%  62 out of 1761
    http_reqs......................: 1761   21.073859/s

    EXECUTION
    iteration_duration.............: avg=1.03s   min=1s     med=1.02s   max=1.15s    p(90)=1.05s   p(95)=1.07s  
    iterations.....................: 1761   21.073859/s
    vus............................: 2      min=1          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 84 MB  1.0 MB/s
    data_sent......................: 123 kB 1.5 kB/s



running (1m23.6s), 00/50 VUs, 1761 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  1m20s